test/tsung/tsung.xml
<?xml version="1.0"?>
<tsung loglevel="notice" version="1.0">
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="1000" />
  </clients>

  <servers>
    <server host="localhost" port="8443" type="ssl" />
  </servers>

  <load>
    <arrivalphase phase="1" duration="10" unit="second">
      <users maxnumber="1" arrivalrate="5" unit="second" />
    </arrivalphase>
  </load>

  <sessions>
    <session name="get_index" weight="1" type="ts_https">
      <request>
         <https url="/" method="GET"></https>
      </request>
    </session>
  </sessions>

</tsung>